  [
    {
        "id": "1" ,
        "name": "Kafteji" ,
        "catégory": "Végétarien" ,
        "type": "Tunisien",
        "image": "https://www.themealdb.com/images/media/meals/1bsv1q1560459826.jpg",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "5 Grands - Pommes de terre",
            "2 cuillères à soupe - Huile d'olive",
            "1 - Poivron vert",
            "5 - Oignons",
            "1 cuillère à soupe - Ras el hanout",
            "500g - Citrouille",
            "24 écorchés - Œufs",
            "Pincement - Sel",
            "Pincement - Poivre"
        ],
        "instructions": [
            "1 : Épluchez les pommes de terre et coupez-les en dés de 5 cm",
            "2 : Versez 1 à 2 cm d'huile d'olive dans une grande poêle et faites-la chauffer à feu vif",
            "3 : Faites revenir les pommes de terre jusqu'à ce qu'elles soient dorées pendant 20 minutes, en les retournant de temps en temps",
            "4 : Égouttez-les sur du papier absorbant",
            "5 : Coupez les poivrons en deux et retirez les graines",
            "6 : Badigeonnez-les d'un peu d'huile d'olive et placez-les, côté coupé vers le bas, sur une plaque de cuisson",
            "7 : Épluchez les oignons et coupez-les en fines rondelles"
        ]

    },
    {
        "id": "2" ,
        "name": "Big Mac" ,
        "catégory": "Bœuf" ,
        "type": "Américain",
        "image": "https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg",
        "preparationTime": 5,
        "cookTime": 10,
        "ingrédients": [
            "400g - Bœuf haché",
            "2 cuillères à soupe - Huile d'olive",
            "2 - Petits pains à hamburger aux graines de sésame",
            "Haché - Oignons",
            "1/4- Laitue iceberg",
            "2 tranches - Fromage",
            "2 grands - Cornichons à l'aneth",
            "1 tasse - Mayonnaise",
            "2 cuillères à café - Vinaigre de vin blanc",
            "Pincement - Poivre",
            "2 cuillères à soupe -Moutarde",
            "1 1/2 cuillères à café - Sel à l'oignon",
            "1 1/2 cuillères à café - Poudre d'ail",
            "1 1/2 cuillères à café - Paprika"

        ],
        "instructions": [
            "1 : Pour la sauce Big Mac, mélanger tous les ingrédients dans un bol, saler et réfrigérer jusqu'à utilisation.",
            "2 : Pour préparer les steaks hachés, saler et poivrer la viande hachée et former 4 boulettes en utilisant environ 1/3 de tasse de viande hachée chacune",
            "3 : Placer chaque boulette sur un carré de papier sulfurisé et aplatir pour former quatre cercles de 15 cm",
            "4 : Faire chauffer l'huile dans une grande poêle à feu vif",
            "5 : En 2 fois, cuire les steaks hachés de bœuf pendant 1 à 2 minutes de chaque côté jusqu'à ce qu'ils soient légèrement grillés et cuits à cœur",
            "6 : Recouvrir avec la couche de pain du milieu et étendre davantage de sauce Big Mac, d'oignon, de laitue, de cornichons, de steak haché et Terminez avec plus de sauce.",
            "7 : Couvrez avec le couvercle du burger avant de servir. Après avoir attendu une demi-heure que votre plat se stabilise, allez faire un jogging ."
        ]

    },
    {
        "id": "3" ,
        "name": "Timbits" ,
        "catégory": "Désserts" ,
        "type": "Canadien",
        "image": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg",
        "preparationTime": 5,
        "cookTime": 15,
        "ingrédients": [
            "2 tasses - Farine",
            "1/3 tassee - Sucre",
            "3 cuillères à café - Levure chimique",
            "½ cuillère à café - Sel",
            "1 battu - Œuf",
            "500g - Lait",
            "¾ tasse - Œufs",
            "3 cuillères à soupe - Huile",
            "pour frire - Huile",
            "garniture - Sucre glace "
        ],
        "instructions": [
            "1 : Tamiser les ingrédients secs",
            "2 : Mélanger les ingrédients humides et les incorporer aux ingrédients secs",
            "3 : Remuer jusqu'à obtenir une consistance lisse",
            "4 : Déposer des cuillerées à café (pas plus) dans l'huile chaude (180 °C, pas plus), en les retournant après quelques instants jusqu'à ce qu'elles soient dorées de tous les côtés",
            "5 : Retirer et égoutter",
            "6 : Rouler dans le sucre à la cannelle pendant qu'il est encore chaud et servir."
        ]

    },
    {
        "id": "4" ,
        "name": "Koshari" ,
        "catégory": "Végétarien" ,
        "type": "Égyptien",
        "image": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "1 1/2 tasses - Lentilles brunes",
            "2 1 1/2 tasses - Riz",
            "1/2 cuillères à café - Coriandre",
            "2 - Macaronis",
            "Peut- Pois chiches",
            "1 grand - Oignons",
            "Arrosage - Sel",
            "1/2 tasses - Huile végétale"
        ],
        "instructions": [
            "1 : Cuire les lentilles. Porter les lentilles et 1,5 l d'eau à ébullition dans une casserole moyenne ou une poêle à feu vif",
            "2 : Réduire le feu à doux et cuire jusqu'à ce que les lentilles soient tendres (15 à 17 minutes).",
            "3 : Égoutter et assaisonner avec un peu de sel",
            "4 : (Remarque : lorsque les lentilles sont prêtes, elles ne doivent pas être entièrement cuites.",
            "5 : Couvrir et cuire jusqu'à ce que tout le liquide soit absorbé et que le riz et Les lentilles sont bien cuites (environ 20 minutes). Couvrir et laisser reposer pendant environ 5 minutes.",
            "6 : Cuire jusqu'à ce que les pâtes soient al dente. Égoutter. Couvrir les pois chiches et les réchauffer brièvement au micro-ondes avant de servir.",
            "7 : Dans une grande poêle, faire chauffer l'huile de cuisson à feu moyen-vif et cuire les rondelles d'oignon en remuant souvent jusqu'à ce qu'elles prennent une belle couleur caramélisée. Les oignons doivent être croustillants, mais pas brûlés (15 à 20 minutes)"
        ]

    },
    {
        "id": "5" ,
        "name": "Shawarma" ,
        "catégory": "Poulet" ,
        "type": "Égyptien",
        "image": "https://www.themealdb.com/images/media/meals/kcv6hj1598733479.jpg",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "1 kg - Cuisses de poulet",
            "1 cuillères à soupe - Coriandre",
            "1 cuillères à soupe - Cumin",
            "1 cuillères à soupe - Cardamome",
            "1 cuillère à café - Poivre de Cayenne",
            "2 cuillère à café - Paprika",
            "2 cuillère à soupe - Jus de citron",
            "3 cuillère à soupe  - Huile d'olive",
            "1 tasse - Yaourt grec",
            "1 - Gousse d'ail",
            "1 cuillère à café - Cumin ",
            "Éclaboussure - Jus de citron ",
            "Tranché - Laitue",
            "Tranché - Tomate",
            "6 - Pain pita"
        ],
        "instructions": [
            "1 : Mélanger les ingrédients de la marinade dans un grand sac ziplock (ou un bol)",
            "2 : Ajouter le poulet et bien enrober chaque morceau avec les mains",
            "3 : Si vous utilisez un sac ziplock, je trouve plus pratique de fermer le sac puis de le masser pour répartir la marinade sur chaque morceau de poulet",
            "4 : Laisser mariner toute la nuit ou jusqu'à 24 heures",
            "5 : Mélanger les ingrédients de la sauce au yaourt dans un bol et mélanger",
            "6 : Couvrir et mettre au réfrigérateur jusqu'à utilisation (la marinade se conserve 3 jours au réfrigérateur)",
            "7 : Garnir d'un peu de laitue, de tomate et de poulet shawarma. Rouler et déguster ! "
        ]

    },
    {
        "id": "6" ,
        "name": "Pâté au poisson" ,
        "catégory": "Fruit de mer" ,
        "type": "Britannique",
        "image": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "900g - Pommes de terre farineuses",
            "2 cuillères à soupe - Huile d'olive",
            "1 - Poivron vert",
            "5 - Oignons",
            "1 cuillère à soupe - Ras el hanout",
            "500g - Citrouille",
            "24 écorchés - Œufs",
            "Pincement - Sel",
            "Pincement - Poivre"
        ],
        "instructions": [
            "1 : Mettez les pommes de terre dans une grande casserole d'eau froide salée et portez à ébullition",
            "2 : Baissez le feu, couvrez, puis laissez mijoter doucement pendant 15 minutes jusqu'à ce qu'elles soient tendres",
            "3 : Égouttez, puis remettez dans la casserole à feu doux pendant 30 secondes pour éliminer l'excédent d'eau.",
            "4 : Écrasez avec 1 cuillère à soupe d'huile d'olive, puis assaisonnez.",
            "5 : Pendant ce temps, versez le lait dans une grande sauteuse, ajoutez le poisson et portez à ébullition.",
            "6 : Retirez du feu, couvrez et laissez reposer 3 minutes",
            "7 : Parsemez de fromage, puis enfournez pour 35 à 40 minutes, jusqu'à ce que la purée soit dorée et bouillonnante. Servez avec des légumes verts fanés ."
        ]

    },
    {
        "id": "7" ,
        "name": "Burek" ,
        "catégory": "Côté" ,
        "type": "croate",
        "image": " https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg",
        "preparationTime": 5,
        "cookTime": 18,
        "ingrédients": [
            "5 Grands - Pommes de terre",
            "2 cuillères à soupe - Huile d'olive",
            "600 ml- Lait demi-écrémé",
            "800g - Filets de poisson blanc",
            "1 cuillère à soupe - Farine nature",
            "Grillade - Noix de muscade",
            "3 cuillère à soupe - Crème double",
            "200g - Topinambours",
            "1 finement tranché - Poireau",
            "200g pelés crus - Crevettes",
            "Une grosse poignée - Persil",
            "Poignée - Aneth",
            "Zeste râpé de 1 - Citron",
            "25g râpé - Gruyère",
            "Jus de 1 - Citron"
        ],
        "instructions": [
            "1 : Faites revenir les oignons finement hachés et la viande hachée dans l'huile.",
            "2 : Beurrez une plaque de cuisson ronde et disposez - y une couche de pâte. ",
            "3 : Recouvrez d'une fine couche de garniture, puis d'une autre couche de pâte filo, bien huilée.",
            "4 : Recouvrez ensuite de garniture et recouvrez de pâte.",
            "5 : Lorsque vous obtenez cinq ou six couches, recouvrez de pâte filo, enfournez à 200 °C pendant une demi-heure, coupez en quatre et servez ."
           
        ]

    },
    {
        "id": "8" ,
        "name": "Sushi" ,
        "catégory": "Fruit de mer" ,
        "type": "Japonais",
        "image": " https://www.themealdb.com/images/media/meals/g046bb1663960946.jpg ",
        "preparationTime": 5,
        "cookTime": 10,
        "ingrédients": [
            "300 ml - Riz à sushi",
            "100 ml - Vin de riz",
            "2 cuillères à soupe - Sucre en poudre",
            "2 cuillères à soupe - Mayonnaise",
            "1 cuillère à soupe - Vin de riz",
            "1 cuillère à soupe - Sauce soja",
            "1 - Concombre"
       
        ],
        "instructions": [
            "1 : Étalez du riz. Posez une feuille de nori sur la natte, côté brillant vers le bas",
            "2 : Trempez vos mains dans l'eau vinaigrée, puis déposez des poignées de riz dessus en une couche de 1 cm d'épaisseur, en laissant le bord le plus éloigné de vous libre.",
            "3 : Étalez de la mayonnaise japonaise. À l'aide d'une cuillère, étalez une fine couche de mayonnaise au milieu du riz",
            "4 : Ajoutez la garniture. Demandez à votre enfant de garnir la mayonnaise d'une ligne de ses garnitures préférées ; ici, nous avons utilisé du thon et du concombre.",
            "5 : Enroulez. Soulevez le bord de la natte sur le riz, en exerçant une légère pression pour que le tout forme un rouleau serré.",
            "6 : Collez les côtés comme un tampon. Lorsque vous obtenez Jusqu'au bord sans riz, badigeonnez d'un peu d'eau et continuez à rouler en un rouleau serré.",
            "7 : Rapprochez les coins du film alimentaire et serrez-les en boules en les tordant, puis déballez et servez ."
        ]

    },
    {
        "id": "9" ,
        "name": "Corba" ,
        "catégory": "Côté" ,
        "type": "turc",
        "image": " https://www.themealdb.com/images/media/meals/58oia61564916529.jpg ",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "1 tasse - Lentilles",
            "1 grand - Oignons",
            "1 grand- Carottes",
            "1 cuillère à soupe - Purée de tomates",
            "2 cuillères à cafée - Cumin",
            "1 cuillères à cafée - Paprika",
            "1/2 cuillères à cafée - Menthe",
            "1/2 cuillères à cafée - Thym",
            "1/4 c. à thé - Poivre noir",
            "1/4 c. à thé - Flocons de piment rouge",
            "4 tasses - Bouillon de légumes",
            "1 tasse - Eau",
            "Pincement - Sel de mer"

        ],
        "instructions": [
            "1 : Triez vos lentilles pour éliminer tout débris, rincez - les 2 ou 3 fois, égouttez-les et réservez.",
            "2 : Attention, cela les transformera probablement en un bloc solide que vous devrez briser plus tard.",
            "3 : Dans une grande casserole à feu moyen-vif, faites revenir l'huile d'olive et l'oignon avec une pincée de sel pendant environ 3 minutes, puis ajoutez les carottes et laissez cuire encore 3 minutes.",
            "4 : Ajoutez le concentré de tomates et remuez pendant environ 1 minute.",
            "5 : Félicitez-vous de l'odeur délicieuse que votre maison sent maintenant. » Ajoutez immédiatement les lentilles, l'eau, le bouillon et le sel.",
            "6 : Portez la soupe à ébullition (douce). » Une fois l'ébullition atteinte, réduisez le feu à moyen-doux, couvrez la casserole à moitié et laissez cuire 10 minutes.",
            "7 : C'est un excellent reste et se conserve environ une semaine au réfrigérateur ."
        ]

    },
    {
        "id": "10" ,
        "name": "Bistek" ,
        "catégory": "Bœuf" ,
        "type": "Philippin",
        "image": "https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg",
        "preparationTime": 5,
        "cookTime": 30,
        "ingrédients": [
            "1 lb - Bœuf",
            "5 cuillères à soupe - Sauce soja",
            "1 - Citron",
            "3 clous de girofle - Ail",
            "3 parties - Oignon",
            "4 cuillères à soupe - Huile d'olive",
            "4 cuillères à soupe - Œufs",
            "1 tasse - Eau",
            "1 pincée - Sel"
        ],
        "instructions": [
            "1 : Faites mariner le bœuf dans de la sauce soja, du citron (ou du calamansi) et du poivre noir moulu pendant au moins 1 heure.",
            "2 : Remarque : laissez mariner toute la nuit pour un résultat optimal.",
            "3 : Faites chauffer l'huile de cuisson dans une poêle, puis faites revenir la moitié des oignons jusqu'à ce qu'ils soient tendres.",
            "4 : Réservez. Égouttez la marinade du bœuf. Réservez. Faites revenir le bœuf dans la même poêle où les oignons ont été frits pendant 1 minute de chaque côté.",
            "5 : Retirez de la poêle. Réservez.Ajoutez plus d'huile si nécessaire.",
            "6 : Faites revenir l'ail et les oignons crus restants jusqu'à ce qu'ils soient tendres.",
            "7 : Garnissez de Oignons.Transférer dans une assiette de service. Servir chaud. Partager et déguster !"
        ]

    },
    {
        "id": "11" ,
        "name": "Wontons" ,
        "catégory": "Porc" ,
        "type": "Chinois",
        "image": "https://www.themealdb.com/images/media/meals/1525876468.jpg",
        "preparationTime": 5,
        "cookTime": 20,
        "ingrédients": [
            "1 lb - Porc",
            "3 Hachés - Gousse d'ail",
            "1 cuillère à cafée- Gingembre",
            "1 cuillère à soupe - Sauce soja",
            "1 cuillère à cafée - Huile de graines de sésame",
            "3 finement hachés - Carottes",
            "3 finement hachés - Céleri",
            "6 Hachés - Oignons nouveaux",
            "1 paquet - Peau de wonton",
            "Friture - Huile",
            "Bouteille - Eau"
        ],
        "instructions": [
            "1 : Mélanger le porc, l'ail, le gingembre, la sauce soja, l'huile de sésame et les légumes dans un bol. ",
            "2 : Séparer les peaux de wonton. » Déposer une cuillère à café bombée de farce au centre des wontons.",
            "3 : Badigeonner d'eau les deux bords de la peau, en couvrant 6 mm du bord.",
            "4 : Replier la peau pour former un triangle et sceller les bords.",
            "5 : Pincer les deux longues pointes extérieures ensemble.",
            "6 : Chauffer l'huile à 230 °C et faire frire 4 à 5 wontons à la fois jusqu'à ce qu'ils soient dorés.",
            "7 : Égoutter et servir avec la sauce."
        ]

    },
    {
        "id": "11" ,
        "name": "Lasagnes" ,
        "catégory": "Pâtes" ,
        "type": "Italien",
        "image": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
        "preparationTime": 5,
        "cookTime": 40,
        "ingrédients": [
            "1 cuillères à soupe - Huile d'olive",
            "2  - Lard",
            "1 finement hachés - Oignon",
            "1 bâto - Céleri",
            "1 moyen - Carottes",
            "2 clous de girofle hachés - Ail",
            "500g - Bœuf haché",
            "1 cuillère à soupe - Purée de tomates",
            "800g - Tomates hachées",
            "1 cuillère à soupe - Chéri",
            "500g - Feuilles de lasagnes",
            "400 ml - Crème Fraîche",
            "125g - Boules de mozzarella",
            "50g - Parmesan",
            "Garniture - Feuilles de basilic"
        ],
        "instructions": [
            "1 : Faites chauffer l'huile dans une grande casserole.",
            "2 : Utilisez des ciseaux de cuisine pour couper le bacon en petits morceaux ou utilisez un couteau bien aiguisé pour le hacher sur une planche à découper.",
            "3 : Ajoutez le bacon dans la poêle et faites-le cuire quelques minutes jusqu'à ce qu'il commence à dorer.",
            "4 : Ajoutez l'oignon, le céleri et la carotte, et faites-les cuire à feu moyen pendant 5 minutes, en remuant de temps en temps, jusqu'à ce qu'ils soient tendres.",
            "5 : Incorporez le concentré de tomates et faites-le cuire 1 minute, en mélangeant bien avec le bœuf et les légumes. ",
            "6 : Ajoutez les tomates concassées. Remplissez chaque boîte à moitié d'eau pour rincer les tomates restantes, puis versez-les dans la poêle.",
            "7 : Servez parsemé de basilic, si vous le souhaitez ."
        ]

    },
    {
        "id": "12" ,
        "name": "Poutine" ,
        "catégory": "Divers" ,
        "type": "Canadien",
        "image": "https://www.themealdb.com/images/media/meals/uuyrrx1487327597.jpg",
        "preparationTime": 5,
        "cookTime": 10,
        "ingrédients": [
            "Tiret - Huile végétale",
            "1 canette - Sauce au bœuf",
            "5 coupes fines - Pommes de terre",
            "2 tasses - Fromage en grains"
        ],
        "instructions": [
            "1 : Faites chauffer l'huile dans une friteuse ou une poêle épaisse à 185 °C (365 °F).",
            "2 : Réchauffez la sauce dans une casserole ou au micro-ondes.",
            "3 : Placez les frites dans l'huile chaude et faites-les cuire jusqu'à ce qu'elles soient légèrement dorées, environ 5 minutes.",
            "4 : Transférez-les sur une assiette recouverte de papier absorbant pour les égoutter.",
            "5 : Placez les frites sur un plat de service et saupoudrez-les de fromage.",
            "6 : Versez la sauce sur les frites et le fromage et servez immédiatement."
        ]

    },
    {
        "id": "13" ,
        "name": "Flamiche" ,
        "catégory": "Végétarien" ,
        "type": "Français",
        "image": "https://www.themealdb.com/images/media/meals/wssvvs1511785879.jpg",
        "preparationTime": 7,
        "cookTime": 50,
        "ingrédients": [
            "75g - Beurre",
            "1kg - Poireau",
            "½ cuillère à café - Sel",
            "300 ml - Crème Fraîche",
            "1 - Œuf",
            "3 - Jaunes d'œufs",
            "¼ cuillère à café - Noix de muscade",
            "225g - Farine nature",
            "½ cuillère à café - Sel",
            "60g - Beurre",
            "60g - Saindoux",
            "50g - Fromage cheddar",
            "2 cuillères à soupe - Eau"
        ],
        "instructions": [
            "1 : Pour la pâte, tamisez la farine et le sel dans le bol d'un robot culinaire, ajoutez le beurre et le saindoux, puis fouettez brièvement jusqu'à obtenir une chapelure fine.",
            "2 : Versez le mélange dans un bol, puis incorporez le fromage et suffisamment d'eau pour que le mélange se tienne.",
            "3 : Versez sur une surface légèrement farinée et pétrissez brièvement jusqu'à obtenir une consistance lisse.",
            "4 : Étalez finement et chemisez un moule à tarte cannelé à fond amovible de 23 cm x 4 cm.",
            "5 : Piquer le fond avec une fourchette. Réfrigérer 20 minutes. Faites fondre 75 g de beurre dans une casserole à feu doux, puis ajoutez les poireaux et le sel.",
            "6 : Couvrez et laissez cuire 10 minutes jusqu'à ce qu'ils soient tendres. Découvrez la casserole, augmentez le feu et laissez cuire 2 minutes en remuant de temps en temps, jusqu'à évaporation du liquide.",
            "7 : Verser la préparation dans le fond de tarte et cuire 35 à 40 minutes, jusqu'à ce que le fond soit pris et légèrement doré. Retirer du four et laisser reposer 10 minutes. Démouler et servir ."
        ]

    }
    
]

